{
    "data": {
        "count": 10,
        "next": "https://yandex-scraper.p.rapidapi.com/search/?query=watermelon&page=2",
        "previous": null,
        "results": [
            {
                "title": "Watermelon - Wikipedia",
                "link": "https://en.wikipedia.org/wiki/Watermelon",
                "description": "Watermelon (Citrullus lanatus) is a flowering plant species of the Cucurbitaceae family and the name of its edible fruit."
            },
            {
                "title": "Watermelon — properties, vitamins, sugar, calories. | Medium",
                "link": "https://glamstyle.medium.com/watermelon-properties-vitamins-sugar-calories-what-do-we-love-this-delicious-fruit-for-eaad68d69a77",
                "description": "Watermelon is one of those fruits that, thanks to its high water content, quenches our thirst during the hot summer months. It is also a perfect ingredient for cocktails and desserts."
            },
            {
                "title": "Watermelon : A Complete Guide to the Juicy Fruit",
                "link": "https://www.draftpublicnews.eu.org/2023/06/watermelon-complete-guide-to-juicy-fruit.html",
                "description": "In this comprehensive guide, we will explore the origins, nutritional benefits, cultivation techniques, popular varieties, and various culinary uses of watermelon."
            },
            {
                "title": "watermelon – English to Russian translation – Yandex...",
                "link": "https://translate.yandex.com/en/dictionary/English-Russian/watermelon",
                "description": "Looking for the watermelon translation from English into Russian? Yandex Translate has got you covered! Our free and reliable tool provides accurate translations for over 90..."
            },
            {
                "title": "Watermelon: Berry Or Fruit? | ShunCy",
                "link": "https://shuncy.com/article/is-watermelon-a-berry-or-a-fruit",
                "description": "While it may seem obvious that watermelon is a fruit, the truth is actually quite surprising. Watermelon is not only a fruit, but also classified as a berry."
            },
            {
                "title": "Watermelon - New World Encyclopedia",
                "link": "https://www.newworldencyclopedia.org/entry/Watermelon",
                "description": "The flesh is similar to the rind of a watermelon and is often known as citron melon (distinct from the actual citron, of the citrus family)."
            },
            {
                "title": "Watermelon: Nutrition facts, benefits, and downsides",
                "link": "https://feelgoodpal.com/blog/watermelon/",
                "description": "Watermelon nutrition facts. Watermelon consists mostly of water (91%) and carbs (7.5%). It provides almost no protein or fat and is very low in calories."
            },
            {
                "title": "Is Watermelon a Berry or a Fruit?",
                "link": "https://gardeningbank.com/is-watermelon-berry-or-fruit/",
                "description": "Watermelon (Citrullus lanatus) is a succulent fruit and vine-like plant belonging to the Cucurbitaceae family; it is native to equatorial Africa and grown worldwide."
            },
            {
                "title": "What Is The History Of Watermelon? - Stellina Marfa",
                "link": "https://stellinamarfa.com/fruits/what-is-the-history-of-watermelon/",
                "description": "Watermelon’s history dates back 5000 years to southern Africa where the tough, drought-tolerant ancestor of watermelon thrived."
            },
            {
                "title": "Is A Watermelon A Berry (Or Vegetable)?",
                "link": "https://www.plantgardener.com/watermelon-berry/",
                "description": "A watermelon is a common summertime fruit, but it is also a vegetable. It belongs to the gourd family and is considered a berry."
            }
        ]
    },
    "error": null
}